IRP/src/Documents/Production/Production.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Production</name>
  <registerRecords>AccumulationRegister.MF_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.MF_ProductionPlanning</registerRecords>
  <registerRecords>AccumulationRegister.MF_LandedCostPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
  <registerRecords>AccumulationRegister.MF_DetailingSupplies</registerRecords>
  <registerRecords>AccumulationRegister.R4036B_IncomingStocksRequested</registerRecords>
  <registerRecords>AccumulationRegister.R4033B_GoodsReceiptSchedule</registerRecords>
  <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
  <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
  <registerRecords>AccumulationRegister.R7040T_ManualMaterialsCorretionInProduction</registerRecords>
  <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
  <registerRecords>InformationRegister.T6010S_BatchesInfo</registerRecords>
  <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
  <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
  <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
  <registerRecords>AccumulationRegister.R4050B_StockInventory</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>StoreProduction</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </attributes>
  <attributes>
    <name>BillOfMaterials</name>
    <type>
      <types>CatalogRef.BillOfMaterials</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionPlanning</name>
    <type>
      <types>DocumentRef.ProductionPlanning</types>
    </type>
  </attributes>
  <attributes>
    <name>Finished</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionType</name>
    <type>
      <types>EnumRef.ProductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Materials</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ItemBOM</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKeyBOM</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>UnitBOM</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBOM</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>IsManualChanged</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialType</name>
      <type>
        <types>EnumRef.MaterialTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>WriteoffStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Documents/Production/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	If WriteMode = DocumentWriteMode.Posting Then
		If ThisObject.Stages.Count() Then
			ThisObject.Finished = ThisObject.Stages[ThisObject.Stages.Count()-1].Done;
		Else
			ThisObject.Finished = True;
		EndIf;
	Else
		ThisObject.Finished = False;
	EndIf;
	For Each Row In ThisObject.Stages Do
		If Not ValueIsFilled(Row.Key) Then
			Row.Key = New UUID();
		EndIf;
	EndDo;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ValueIsFilled(ThisObject.ProductionPlanning)
		And ThisObject.Date < ThisObject.ProductionPlanning.Date Then
			Cancel = True;
			MessageText = StrTemplate(R().MF_Error_004, 
			ThisObject.Date, 
			ThisObject.ProductionPlanning.Date);
			CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.Date", "Object");
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData = Undefined Then
		ThisObject.Finished = True;
		ThisObject.ProductionType = Enums.MF_ProductionTypes.Product;
		Return;
	EndIf;
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") And FillingData.BasedOn = "MF_ProductionPlanning" Then
			ThisObject.ProductionPlanning = FillingData.ProductionPlanning;
			ThisObject.Company           = FillingData.Company;
			ThisObject.StoreProduction   = FillingData.StoreProduction;
			ThisObject.BusinessUnit      = FillingData.BusinessUnit;
			ThisObject.Item              = FillingData.Item;
			ThisObject.ItemKey           = FillingData.ItemKey;
			ThisObject.Unit              = FillingData.Unit;
			ThisObject.Quantity          = FillingData.Quantity;
			ThisObject.BillOfMaterials   = FillingData.BillOfMaterials;
			ThisObject.ProductionType    = FillingData.ProductionType;
			ThisObject.PlanningPeriod    = FillingData.PlanningPeriod;
			
			BillOfMaterials_UUID = String(ThisObject.BillOfMaterials.UUID());
			For Each Row In FillingData.Materials Do
				NewRow = ThisObject.Materials.Add();
				NewRow.Item         = Row.Item;
				NewRow.ItemKey      = Row.ItemKey;
				NewRow.Unit         = Row.Unit;
				NewRow.Quantity     = Row.Quantity;
				NewRow.Procurement  = Row.Procurement;
				NewRow.MaterialType = Row.MaterialType;
				NewRow.WriteoffStore= Row.WriteoffStore;
				
				NewRow.ItemBOM     = Row.Item;
				NewRow.ItemKeyBOM  = Row.ItemKey;
				NewRow.UnitBOM     = Row.Unit;
				NewRow.QuantityBOM = Row.Quantity;
				
				RowUniqueID = String(Row.ItemKey.UUID()) + "-" + BillOfMaterials_UUID;
				NewRow.UniqueID = RowUniqueID;
				
			EndDo;
			
			For Each Row In FillingData.Stages Do
				NewRow = ThisObject.Stages.Add();
				NewRow.Stage = Row.Stage;
			EndDo;
		EndIf;
	EndIf;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	If ThisObject.ProductionType = Enums.MF_ProductionTypes.Product Then
		Try
			PostSemiproductsProduction();
		Except
			Cancel = True;
			GetUserMessages(ErrorDescription());
		EndTry;
	EndIf;
EndProcedure

Procedure PostSemiproductsProduction()
	Query = New Query();
	Query.Text = 
	"SELECT
	|	MF_Procurements.OutputID
	|FROM
	|	InformationRegister.MF_Procurements AS MF_Procurements
	|WHERE
	|	MF_Procurements.Document = &Ref
	|	AND MF_Procurements.ProcurementType = VALUE(Enum.MF_ProcurementTypes.Produce)";
	Query.SetParameter("Ref", ThisObject.Ref);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	ArrayOfSemiproductProduction = New Array();
	While QuerySelection.Next() Do
		GetSemiproductProductionRecursive(ArrayOfSemiproductProduction, QuerySelection.OutputID);
	EndDo;
	For Each ItemOfSemiproductProduction In ArrayOfSemiproductProduction Do
		ObjectProduction = ItemOfSemiproductProduction.GetObject();
		ObjectProduction.Write(DocumentWriteMode.Posting);
	EndDo;
EndProcedure

Procedure GetSemiproductProductionRecursive(ArrayOfSemiproductProduction, OutputID)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	MF_Procurements.Document,
	|	MF_Procurements.OutputID
	|FROM
	|	InformationRegister.MF_Procurements AS MF_Procurements
	|WHERE
	|	MF_Procurements.InputID = &OutputID
	|	AND MF_Procurements.ProcurementType = VALUE(Enum.MF_ProcurementTypes.Produce)
	|	AND MF_Procurements.Document.Posted";
	Query.SetParameter("OutputID", OutputID);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	While QuerySelection.Next() Do
		If ValueIsFilled(QuerySelection.OutputID) Then
			GetSemiproductProductionRecursive(ArrayOfSemiproductProduction, QuerySelection.OutputID);
		EndIf;
		ArrayOfSemiproductProduction.Add(QuerySelection.Document);
	EndDo;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure
